{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "vgg16", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv3", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv3", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc1", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc2", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "predictions", "trainable": true, "dtype": "float32", "units": 1000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "predictions", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "metrics": [[{"class_name": "CategoricalAccuracy", "config": {"name": "categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of132.bin", "group1-shard2of132.bin", "group1-shard3of132.bin", "group1-shard4of132.bin", "group1-shard5of132.bin", "group1-shard6of132.bin", "group1-shard7of132.bin", "group1-shard8of132.bin", "group1-shard9of132.bin", "group1-shard10of132.bin", "group1-shard11of132.bin", "group1-shard12of132.bin", "group1-shard13of132.bin", "group1-shard14of132.bin", "group1-shard15of132.bin", "group1-shard16of132.bin", "group1-shard17of132.bin", "group1-shard18of132.bin", "group1-shard19of132.bin", "group1-shard20of132.bin", "group1-shard21of132.bin", "group1-shard22of132.bin", "group1-shard23of132.bin", "group1-shard24of132.bin", "group1-shard25of132.bin", "group1-shard26of132.bin", "group1-shard27of132.bin", "group1-shard28of132.bin", "group1-shard29of132.bin", "group1-shard30of132.bin", "group1-shard31of132.bin", "group1-shard32of132.bin", "group1-shard33of132.bin", "group1-shard34of132.bin", "group1-shard35of132.bin", "group1-shard36of132.bin", "group1-shard37of132.bin", "group1-shard38of132.bin", "group1-shard39of132.bin", "group1-shard40of132.bin", "group1-shard41of132.bin", "group1-shard42of132.bin", "group1-shard43of132.bin", "group1-shard44of132.bin", "group1-shard45of132.bin", "group1-shard46of132.bin", "group1-shard47of132.bin", "group1-shard48of132.bin", "group1-shard49of132.bin", "group1-shard50of132.bin", "group1-shard51of132.bin", "group1-shard52of132.bin", "group1-shard53of132.bin", "group1-shard54of132.bin", "group1-shard55of132.bin", "group1-shard56of132.bin", "group1-shard57of132.bin", "group1-shard58of132.bin", "group1-shard59of132.bin", "group1-shard60of132.bin", "group1-shard61of132.bin", "group1-shard62of132.bin", "group1-shard63of132.bin", "group1-shard64of132.bin", "group1-shard65of132.bin", "group1-shard66of132.bin", "group1-shard67of132.bin", "group1-shard68of132.bin", "group1-shard69of132.bin", "group1-shard70of132.bin", "group1-shard71of132.bin", "group1-shard72of132.bin", "group1-shard73of132.bin", "group1-shard74of132.bin", "group1-shard75of132.bin", "group1-shard76of132.bin", "group1-shard77of132.bin", "group1-shard78of132.bin", "group1-shard79of132.bin", "group1-shard80of132.bin", "group1-shard81of132.bin", "group1-shard82of132.bin", "group1-shard83of132.bin", "group1-shard84of132.bin", "group1-shard85of132.bin", "group1-shard86of132.bin", "group1-shard87of132.bin", "group1-shard88of132.bin", "group1-shard89of132.bin", "group1-shard90of132.bin", "group1-shard91of132.bin", "group1-shard92of132.bin", "group1-shard93of132.bin", "group1-shard94of132.bin", "group1-shard95of132.bin", "group1-shard96of132.bin", "group1-shard97of132.bin", "group1-shard98of132.bin", "group1-shard99of132.bin", "group1-shard100of132.bin", "group1-shard101of132.bin", "group1-shard102of132.bin", "group1-shard103of132.bin", "group1-shard104of132.bin", "group1-shard105of132.bin", "group1-shard106of132.bin", "group1-shard107of132.bin", "group1-shard108of132.bin", "group1-shard109of132.bin", "group1-shard110of132.bin", "group1-shard111of132.bin", "group1-shard112of132.bin", "group1-shard113of132.bin", "group1-shard114of132.bin", "group1-shard115of132.bin", "group1-shard116of132.bin", "group1-shard117of132.bin", "group1-shard118of132.bin", "group1-shard119of132.bin", "group1-shard120of132.bin", "group1-shard121of132.bin", "group1-shard122of132.bin", "group1-shard123of132.bin", "group1-shard124of132.bin", "group1-shard125of132.bin", "group1-shard126of132.bin", "group1-shard127of132.bin", "group1-shard128of132.bin", "group1-shard129of132.bin", "group1-shard130of132.bin", "group1-shard131of132.bin", "group1-shard132of132.bin"], "weights": [{"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "fc1/kernel", "shape": [25088, 4096], "dtype": "float32"}, {"name": "fc1/bias", "shape": [4096], "dtype": "float32"}, {"name": "fc2/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "fc2/bias", "shape": [4096], "dtype": "float32"}, {"name": "predictions/kernel", "shape": [4096, 1000], "dtype": "float32"}, {"name": "predictions/bias", "shape": [1000], "dtype": "float32"}]}]}